{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "e7f201fa-9989-402a-b8bc-772c1f82e7c0",
   "metadata": {},
   "source": [
    "## Task \"Форматированный вывод\"\n",
    "\n",
    "Вам доступен архив workbook.zip, содержащий различные папки и файлы. Напишите программу, которая выводит названия всех файлов из этого архива в лексикографическом порядке, указывая для каждого его дату изменения, а также объем до и после сжатия, в следующем формате:\n",
    "\n",
    "<название файла>  \n",
    "  Дата модификации файла: <дата изменения>  \n",
    "  Объем исходного файла: <объем до сжатия> байт(а)  \n",
    "  Объем сжатого файла: <объем после сжатия> байт(а)  \n",
    "\n",
    "Между данными о двух файлах должна располагаться пустая строка.\n",
    "\n",
    "**Примечание 1.** Если файл находится в папке, вывести следует только название без пути."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "d541bf32-2b40-4fcc-971d-aea48f745462",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Alexandra Savior – Crying All the Time.mp3\n",
      "  Дата модификации файла: 2021-11-30 13:27:02\n",
      "  Объем исходного файла: 5057559 байт(а)\n",
      "  Объем сжатого файла: 5051745 байт(а)\n",
      "\n",
      "Hollow Knight Silksong.exe\n",
      "  Дата модификации файла: 2013-08-22 08:20:06\n",
      "  Объем исходного файла: 805992 байт(а)\n",
      "  Объем сжатого файла: 494930 байт(а)\n",
      "\n",
      "Psychonauts 2.exe\n",
      "  Дата модификации файла: 2013-08-22 08:20:06\n",
      "  Объем исходного файла: 805992 байт(а)\n",
      "  Объем сжатого файла: 494930 байт(а)\n",
      "\n",
      "code.jpeg\n",
      "  Дата модификации файла: 2021-11-30 13:18:26\n",
      "  Объем исходного файла: 412414 байт(а)\n",
      "  Объем сжатого файла: 410006 байт(а)\n",
      "\n",
      "countries.json\n",
      "  Дата модификации файла: 2021-11-30 19:42:40\n",
      "  Объем исходного файла: 22 байт(а)\n",
      "  Объем сжатого файла: 22 байт(а)\n",
      "\n",
      "data_sample.csv\n",
      "  Дата модификации файла: 2021-11-30 19:41:58\n",
      "  Объем исходного файла: 15 байт(а)\n",
      "  Объем сжатого файла: 15 байт(а)\n",
      "\n",
      "earth.jpg\n",
      "  Дата модификации файла: 2021-11-30 20:15:26\n",
      "  Объем исходного файла: 335250 байт(а)\n",
      "  Объем сжатого файла: 330037 байт(а)\n",
      "\n",
      "exam.txt\n",
      "  Дата модификации файла: 2021-11-30 20:16:44\n",
      "  Объем исходного файла: 9 байт(а)\n",
      "  Объем сжатого файла: 9 байт(а)\n",
      "\n",
      "fipi_demo_2022.pdf\n",
      "  Дата модификации файла: 2021-11-30 14:33:56\n",
      "  Объем исходного файла: 682337 байт(а)\n",
      "  Объем сжатого файла: 624606 байт(а)\n",
      "\n",
      "fontlist-v330.json\n",
      "  Дата модификации файла: 2021-11-19 10:53:12\n",
      "  Объем исходного файла: 96401 байт(а)\n",
      "  Объем сжатого файла: 4803 байт(а)\n",
      "\n",
      "homework.py\n",
      "  Дата модификации файла: 2021-11-30 14:36:06\n",
      "  Объем исходного файла: 14 байт(а)\n",
      "  Объем сжатого файла: 14 байт(а)\n",
      "\n",
      "how to prove.pdf\n",
      "  Дата модификации файла: 2021-11-30 13:27:36\n",
      "  Объем исходного файла: 660617 байт(а)\n",
      "  Объем сжатого файла: 654933 байт(а)\n",
      "\n",
      "python.pdf\n",
      "  Дата модификации файла: 2021-11-30 20:22:40\n",
      "  Объем исходного файла: 8237200 байт(а)\n",
      "  Объем сжатого файла: 7606256 байт(а)\n",
      "\n",
      "readme.txt\n",
      "  Дата модификации файла: 2021-11-30 20:16:56\n",
      "  Объем исходного файла: 14 байт(а)\n",
      "  Объем сжатого файла: 14 байт(а)\n",
      "\n",
      "shopping_list.txt\n",
      "  Дата модификации файла: 2021-11-30 14:32:44\n",
      "  Объем исходного файла: 25 байт(а)\n",
      "  Объем сжатого файла: 25 байт(а)\n",
      "\n",
      "stepik.png\n",
      "  Дата модификации файла: 2021-11-30 13:28:14\n",
      "  Объем исходного файла: 11378 байт(а)\n",
      "  Объем сжатого файла: 10294 байт(а)\n",
      "\n",
      "task_results.xlsx\n",
      "  Дата модификации файла: 2021-11-30 20:21:32\n",
      "  Объем исходного файла: 13420 байт(а)\n",
      "  Объем сжатого файла: 11039 байт(а)\n",
      "\n",
      "test.py\n",
      "  Дата модификации файла: 2021-11-30 14:09:04\n",
      "  Объем исходного файла: 42 байт(а)\n",
      "  Объем сжатого файла: 42 байт(а)\n",
      "\n"
     ]
    }
   ],
   "source": [
    "from zipfile import ZipFile\n",
    "from datetime import datetime\n",
    "\n",
    "\n",
    "def print_file_attrib(file):\n",
    "    print(file.filename.split('/')[-1])\n",
    "    print(f'  Дата модификации файла: {datetime(*file.date_time)}')\n",
    "    print(f'  Объем исходного файла: {file.file_size} байт(а)')\n",
    "    print(f'  Объем сжатого файла: {file.compress_size} байт(а)')\n",
    "    print()\n",
    "\n",
    "    \n",
    "with ZipFile('../data/workbook.zip', 'r') as zip_file:\n",
    "    [print_file_attrib(x) for x in sorted(zip_file.infolist(), key=lambda x: x.filename.split('/')[-1]) if not x.is_dir()]"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.16"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
