{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "bfa892d3-8e42-4c6f-9cb1-e8b019224752",
   "metadata": {},
   "source": [
    "## Task \"Общественное питание 😰\"\n",
    "Вам доступен файл food_services.json, содержащий список JSON-объектов, которые представляют данные о заведениях общественного питания:\n",
    "\n",
    "[  \n",
    "   {  \n",
    "      \"Name\": \"СМЕТАНА\",  \n",
    "      \"IsNetObject\": \"нет\",  \n",
    "      \"OperatingCompany\": \"\",  \n",
    "      \"TypeObject\": \"кафе\",  \n",
    "      \"AdmArea\": \"Северо-Восточный административный округ\",  \n",
    "      \"District\": \"Ярославский район\",  \n",
    "      \"Address\": \"город Москва, улица Егора Абакумова, дом 9\",  \n",
    "      \"SeatsCount\": 48  \n",
    "   },  \n",
    "   ...  \n",
    "]\n",
    "\n",
    "Под «заведением» будем подразумевать один JSON-объект из этого списка. У заведения имеются следующие атрибуты:\n",
    "\n",
    "* Name — название \n",
    "* IsNetObject — да\\нет в зависимости от того, является ли заведение сетевым\n",
    "* OperatingCompany — название сети\n",
    "* TypeObject — вид (кафе, столовая, ресторан и т.д.)\n",
    "* AdmArea — административная зона\n",
    "* District — район\n",
    "* Address — полный адрес\n",
    "* SeatsCount — количество посадочных мест\n",
    "\n",
    "Напишите программу, которая определяет все виды заведений и для каждого вида находит самое большое заведение этого вида (имеет наибольшее количество посадочных мест). Программа должна вывести все виды заведений в лексикографическом порядке, указав для каждого самое большое заведение и количество посадочных мест в нем. Данные о заведениях должны быть расположены каждые на отдельной строке, в следующем формате:\n",
    "\n",
    "<вид заведения>: <название заведения>, <количество посадочных мест>  \n",
    "\n",
    "**Примечание 1.** Начальная часть ответа выглядит так:\n",
    "\n",
    "бар: Барное объединение ПРОФСОЮЗ, 800  \n",
    "буфет: СТОЛОВАЯ - КАНТИНАСИТИ, 320  \n",
    "закусочная: Бургерная FARШ, 74  \n",
    "...\n",
    "\n",
    "**Примечание 2.** При открытии файла используйте явное указание кодировки UTF-8."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "68c80e89-f03f-4f2c-ba92-33c611dc3747",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "бар: Барное объединение ПРОФСОЮЗ, 800\n",
      "буфет: СТОЛОВАЯ - КАНТИНАСИТИ, 320\n",
      "закусочная: Бургерная FARШ, 74\n",
      "кафе: Чайхана, 800\n",
      "кафетерий: ЗОАР кафе, 200\n",
      "магазин (отдел кулинарии): Соль, 100\n",
      "предприятие быстрого обслуживания: МАКДОНАЛДС, 580\n",
      "ресторан: РУМ СЕРВИС, 1200\n",
      "столовая: Трапезная, 1400\n"
     ]
    }
   ],
   "source": [
    "import json\n",
    "\n",
    "type_dict = {}\n",
    "result = []\n",
    "with open('../data/food_services_2.json', 'r', encoding='utf-8') as file:\n",
    "    data = json.load(file)\n",
    "\n",
    "for item in data:\n",
    "    type_dict.setdefault(item['TypeObject'], []).append([item['Name'], item['SeatsCount']])\n",
    "\n",
    "for key, value in type_dict.items():\n",
    "    result.append([key, *max(value, key=lambda x: x[1])])\n",
    "\n",
    "for r in sorted(result):\n",
    "    print(f'{r[0]}: {\", \".join(map(str, r[1:]))}')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.16"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
