{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "07a29e57-0bea-4c31-86fd-3031e8acb419",
   "metadata": {},
   "source": [
    "## Task \"Wi-Fi Москвы\"\n",
    "\n",
    "Вам доступен файл wifi.csv, который содержит данные о городском Wi-Fi Москвы. В первом столбце записано название округа, во втором — название района, в третьем — адрес, в четвертом — количество точек доступа по этому адресу:\n",
    "\n",
    "adm_area;district;location;number_of_access_points  \n",
    "Центральный административный округ;район Якиманка;город Москва, улица Серафимовича, дом 5/16;5  \n",
    "Центральный административный округ;район Якиманка;город Москва, Болотная набережная, дом 11, строение 1;2  \n",
    "...\n",
    "\n",
    "Напишите программу, которая определяет количество точек доступа в каждом районе Москвы и выводит названия всех районов, для каждого указывая соответствующее количество точек доступа, каждое на отдельной строке, в следующем формате:\n",
    "\n",
    "<название района>: <количество точек доступа>\n",
    "\n",
    "Названия районов должны быть расположены в порядке убывания количества точек доступа, при совпадении количества точек доступа — в лексикографическом порядке.\n",
    "\n",
    "**Примечание 1.** Разделителем в файле wifi.csv является точка с запятой, при этом кавычки не используются.\n",
    "\n",
    "**Примечание 2.** При сортировке названия районов должны быть использованы именно в том виде, в котором они указаны в исходном файле. Выполнять какие-либо дополнительные преобразования не нужно.\n",
    "\n",
    "**Примечание 3.** Начальная часть ответа выглядит так:\n",
    "\n",
    "Тверской район: 480  \n",
    "район Хамовники: 386  \n",
    "Пресненский район: 349  \n",
    "...\n",
    "\n",
    "**Примечание 4.** При открытии файла используйте явное указание кодировки UTF-8."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "532bda1b-994e-42ea-956d-d153c5d51185",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Тверской район: 480\n",
      "район Хамовники: 386\n",
      "Пресненский район: 349\n",
      "Басманный район: 343\n",
      "район Замоскворечье: 308\n",
      "Мещанский район: 228\n",
      "Таганский район: 212\n",
      "район Якиманка: 201\n",
      "район Арбат: 184\n",
      "Красносельский район: 142\n",
      "район Дорогомилово: 92\n",
      "Донской район: 51\n",
      "Даниловский район: 47\n",
      "район Беговой: 35\n",
      "район Марьина Роща: 18\n",
      "Южнопортовый район: 6\n",
      "Гагаринский район: 4\n",
      "Хорошёвский район: 4\n",
      "район Марьино: 4\n",
      "район Проспект Вернадского: 2\n",
      "район Лефортово: 1\n"
     ]
    }
   ],
   "source": [
    "import csv\n",
    "\n",
    "domains_counter = {}\n",
    "with open('../data/wifi.csv', 'r', encoding='utf-8') as file:\n",
    "    districts = [(x['district'], int(x['number_of_access_points'])) for x in csv.DictReader(file, delimiter=';')]\n",
    "wifi_counter = {}\n",
    "for district in districts:\n",
    "    wifi_counter[district[0]] = wifi_counter.get(district[0], 0) + district[1]\n",
    "\n",
    "print(*[f'{x[0]}: {x[1]}' for x in sorted(wifi_counter.items(), key=lambda x: (-x[1], x[0]))], sep='\\n')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.16"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
