{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "ecc02014-c25d-47d6-a135-b782730fa629",
   "metadata": {},
   "source": [
    "## Task \"Одинокая функция\"\n",
    "\n",
    "Дан pickle файл, содержащий единственную сериализованную функцию. Напишите программу, которая вызывает данную функцию с заданными аргументами и выводит возвращаемое значение функции.\n",
    "\n",
    "**Формат входных данных**\n",
    "\n",
    "На вход программе в первой строке подается название pickle файла, в котором содержится единственная сериализованная функция. Далее подается произвольное количество строк, каждая из которых содержит позиционный аргумент для этой функции.\n",
    "\n",
    "**Формат выходных данных**\n",
    "Программа должна вызвать функцию из указанного pickle файла со всеми введенными строковыми аргументами, и вывести возвращаемое значение функции. Причем аргументы должны быть переданы в том порядке, в котором они были введены.\n",
    "\n",
    "**Примечание 1.** Аргументы, передаваемые в функцию, должны иметь тип str.\n",
    "\n",
    "**Примечание 2.** Рассмотрим первый тест. Сначала подается название файла — func.pkl, в котором содержится сериализованная функция:\n",
    "\n",
    "def func(*args):  \n",
    "    return ' '.join(args)\n",
    "\n",
    "затем аргументы для этой функции: Hello,, how, are, you и today?.\n",
    "\n",
    "Программа выводит результат следующего вызова:\n",
    "\n",
    "func('Hello,', 'how', 'are', 'you', 'today?')\n",
    "\n",
    "**Примечание 3.** Для считывания произвольного количества строк используйте потоковый ввод sys.stdin.\n",
    "\n",
    "**Примечание 4.** Считайте, что вводимый файл находится в папке с программой.\n",
    "\n",
    "**Примечание 5.** В этой задаче за кулисами реализовано две функции с именами func и add. Не используйте эти имена для именования своих переменных во избежание ошибок."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "fa3032ed-f5ec-4530-8099-074d183c1e75",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pickle\n",
    "import sys\n",
    "\n",
    "with open(input(), 'rb') as file:\n",
    "    print(pickle.load(file)(*sys.stdin.read().split()))"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.16"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
