{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "d3635f2e-2bc9-4ba6-9b58-855f8f2ea366",
   "metadata": {},
   "source": [
    "## Task\n",
    "\n",
    "Даны две даты — левая и правая границы диапазона соответственно. Напишите программу, которая из этого диапазона, включая границы, выводит, начиная с даты, у которой сумма дня и месяца нечетная, каждую третью дату, только если она не понедельник и не четверг.\n",
    "\n",
    "**Формат входных данных**  \n",
    "На вход программе подаются две даты в формате DD.MM.YYYY — левая и правая границы диапазона соответственно, каждая на отдельной строке. Гарантируется, что первая дата не больше второй.\n",
    "\n",
    "**Формат выходных данных**  \n",
    "Программа должна из указанного диапазона, включая концы, вывести, начиная с даты, у которой сумма дня и месяца нечетная, каждую третью дату, только если она не понедельник и не четверг. Даты должны быть расположены каждая на отдельной строке, в формате DD.MM.YYYY.\n",
    "\n",
    "**Примечание 1.** Если дат, удовлетворяющих условию, нет, программа ничего не должна выводить.\n",
    "\n",
    "**Примечание 2.** Рассмотрим второй тест. Левая граница диапазона 07.03.2021 не является начальной датой, так как имеет четную сумму дня и месяца, поэтому в качестве начальной берем следующую дату 08.03.2021. Дата 08.03.2021 не выводится, так как является понедельником, поэтому двигаемся к следующей дате с шагом три: 11.03.2021. Дата 11.03.2021 не выводится, так как является четвергом."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "020ad45e-6700-416e-b726-a03d5ddfb530",
   "metadata": {},
   "outputs": [],
   "source": [
    "from datetime import datetime, timedelta\n",
    "\n",
    "start_date = 0\n",
    "l_date = datetime.strptime('07.03.2021', '%d.%m.%Y')\n",
    "r_date = datetime.strptime('13.03.2021', '%d.%m.%Y')\n",
    "\n",
    "period = [l_date + timedelta(n) for n in range(int((r_date - l_date).days) + 1)]\n",
    "for num, d in enumerate(period):\n",
    "    if (d.day + d.month) % 2 != 0:\n",
    "        start_date = num\n",
    "        break\n",
    "\n",
    "for item in period[start_date:: 3]:\n",
    "    if item.strftime('%w') not in ['1', '4']:\n",
    "        print(item.strftime('%d.%m.%Y'))"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.16"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
