{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Task \"Булочный магнат\"\n",
    "\n",
    "После ухода сети Макдональдс из России Тимур решил открыть свою небольшую бургерную. Цена каждого бургера в его ресторане определяется количеством ингредиентов, которые выбирает сам посетитель. Вам доступны словари, в которых в качестве ключа указано название ингредиента, а в качестве значения — его цена. Все ингредиенты разбиты по категориям, например, овощи содержатся в одном словаре, соусы — в другом.\n",
    "\n",
    "Напишите программу, которая принимает на вход ингредиенты, выбранные посетителем, и определяет их общую стоимость.\n",
    "\n",
    "**Формат входных данных**\n",
    "\n",
    "На вход программе подается последовательность ингредиентов, разделенных запятой без пробелов.\n",
    "\n",
    "**Формат выходных данных**\n",
    "\n",
    "Программа должна определить общую стоимость введенных ингредиентов и вывести полученный результат в виде чека, в котором указаны ингредиенты в лексикографическом порядке, количество каждых и их общая стоимость, в следующем формате:\n",
    "\n",
    "<ингредиент 1> x <количество 1>  \n",
    "<ингредиент 2> x <количество 2>  \n",
    "...  \n",
    "-------------------------------  \n",
    "ИТОГ: <общая стоимость>р\n",
    "\n",
    "**Примечание 1.** Программа должна добавлять нужное количество пробелов, если один ингредиент имеет меньшую длину, чем другие.\n",
    "\n",
    "**Примечание 2.** Длина пунктирной линии должна равняться длине самой длинной строки в чеке, включая строку с итоговой стоимостью.\n",
    "\n",
    "**Примечание 3.** Гарантируется, что все ингредиенты, выбранные посетителем, присутствуют в словарях."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "ChainMap({'булочка с кунжутом': 15, 'обычная булочка': 10, 'ржаная булочка': 15}, {'куриный бифштекс': 50, 'говяжий бифштекс': 70, 'рыбный бифштекс': 40}, {'сливочно-чесночный': 15, 'кетчуп': 10, 'горчица': 10, 'барбекю': 15, 'чили': 15}, {'лук': 10, 'салат': 15, 'помидор': 15, 'огурцы': 10}, {'сыр': 25, 'яйцо': 15, 'бекон': 30})\n",
      "[('барбекю', 1), ('говяжий бифштекс', 1), ('помидор', 1), ('ржаная булочка', 2), ('салат', 1), ('сыр', 2)]\n",
      "195\n"
     ]
    }
   ],
   "source": [
    "from collections import Counter, ChainMap\n",
    "\n",
    "\n",
    "bread = {'булочка с кунжутом': 15, 'обычная булочка': 10, 'ржаная булочка': 15}\n",
    "meat = {'куриный бифштекс': 50, 'говяжий бифштекс': 70, 'рыбный бифштекс': 40}\n",
    "sauce = {'сливочно-чесночный': 15, 'кетчуп': 10, 'горчица': 10, 'барбекю': 15, 'чили': 15}\n",
    "vegetables = {'лук': 10, 'салат': 15, 'помидор': 15, 'огурцы': 10}\n",
    "toppings = {'сыр': 25, 'яйцо': 15, 'бекон': 30}\n",
    "\n",
    "burger_dict = ChainMap(bread, meat, sauce, vegetables, toppings)\n",
    "\n",
    "print(burger_dict)\n",
    "order = sorted(Counter('ржаная булочка,ржаная булочка,говяжий бифштекс,сыр,сыр,салат,барбекю,помидор'.split(',')).items())\n",
    "burger_price = Counter({comp: (burger_dict[comp] * price) for comp, price in order}).total()\n",
    "\n",
    "print(order)\n",
    "print(burger_price)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "'''\n",
    "барбекю          x 1\n",
    "говяжий бифштекс x 1\n",
    "помидор          x 1\n",
    "ржаная булочка   x 2\n",
    "салат            x 1\n",
    "сыр              x 2\n",
    "--------------------\n",
    "ИТОГ: 195р\n",
    "'''"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
