{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "1e52d8c0-9594-42d1-a198-0d55d4d3983c",
   "metadata": {},
   "source": [
    "## Task \"Вы кто такие? Я вас не звал\"\n",
    "\n",
    "У Тимура имеется немало друзей из других городов или стран, которые часто приезжают к нему в гости с целью увидеться и развлечься. Чтобы не забыть ни об одной встрече, Тимур записывает имена и фамилии друзей в csv файл, дополнительно указывая для каждого дату и время встречи. Вам доступен этот файл, имеющий название meetings.csv, в котором в первом столбце записана фамилия, во втором — имя, в третьем — дата в формате DD.MM.YYYY , в четвертом — время в формате HH:MM:\n",
    "\n",
    "surname,name,meeting_date,meeting_time  \n",
    "Харисов,Артур,15.07.2022,17:00  \n",
    "Геор,Гагиев,14.12.2022,18:00  \n",
    "...\n",
    "\n",
    "Напишите программу, которая выводит фамилии и имена друзей Тимура, предварительно отсортировав их по дате и времени встречи от самой ранней до самой поздней. Фамилии и имена должны быть расположены каждые на отдельной строке.\n",
    "\n",
    "**Примечание 1.** Начальная часть ответа выглядит так:\n",
    "\n",
    "Гудцев Таймураз  \n",
    "Харисов Артур  \n",
    "Базиев Герман  \n",
    "...\n",
    "\n",
    "**Примечание 2.** Гарантируется, что никакие две встречи не имеют одновременно одинаковые даты и время.\n",
    "\n",
    "**Примечание 3.** Разделителем в файле meetings.csv является запятая, при этом кавычки не используются.\n",
    "\n",
    "**Примечание 4.** При открытии файла используйте явное указание кодировки UTF-8."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "ff3e8e5a-2f36-4453-9880-55865a5daae5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Гудцев Таймураз\n",
      "Харисов Артур\n",
      "Базиев Герман\n",
      "Макоев Руслан\n",
      "Найфонов Сослан\n",
      "Короев Аслан\n",
      "Дедегкаев Давид\n",
      "Уртаева Илина\n",
      "Бекузарова Фатима\n",
      "Акоева Лера\n",
      "Белов Глеб\n",
      "Букулова Диана\n",
      "Гусейнова Марьям\n",
      "Набокова Алиса\n",
      "Чередник Марк\n",
      "Перчиков Максим\n",
      "Идрисов Баграт\n",
      "Абаев Михаил\n",
      "Елькина Мария\n",
      "Кораев Давид\n",
      "Акоева Амина\n",
      "Денисов Тимофей\n",
      "Алдатов Сармат\n",
      "Зеленчук Александра\n",
      "Тарасов Станислав\n",
      "Гапбаев Герман\n",
      "Рыжая Ярослава\n",
      "Джикаев Таму\n",
      "Балаболка Вероника\n",
      "Гагиев Геор\n",
      "Козаев Роберт\n",
      "Габараев Артур\n",
      "Юлдашев Хандамир\n",
      "Кодзаев Георгий\n",
      "Дедегкаев Дамир\n",
      "Момотов Владислав\n",
      "Щербак Юрий\n",
      "Чуприков Максим\n",
      "Тиникашвили Давид\n",
      "Кораев Артур\n",
      "Цивинская Анна\n",
      "Солдатенков Илья\n",
      "Туткевич Юрий\n",
      "Маилян Кирилл\n",
      "Джиоева Марина\n",
      "Салбиев Максим\n",
      "Чен Владимир\n",
      "Капустин Егор\n",
      "Туаллагов Давид\n",
      "Губаев Герман\n",
      "Кузнецов Станислав\n",
      "Албегов Хетаг\n",
      "Битиев Сослан\n",
      "Мусиков Андраник\n",
      "Уртаева Дзера\n",
      "Гадзиев Георгий\n",
      "Епхиева Алика\n",
      "Шилин Александр\n"
     ]
    }
   ],
   "source": [
    "import csv\n",
    "from collections import namedtuple\n",
    "from datetime import datetime\n",
    "\n",
    "with open('../data/meetings.csv', 'r', encoding='utf-8') as file:\n",
    "    header, *data = list(csv.reader(file))\n",
    "\n",
    "Scheduler = namedtuple('Scheduler', header)\n",
    "data = sorted([Scheduler(*x) for x in data], key=lambda x: (datetime.strptime(x.meeting_date, '%d.%m.%Y').date(), datetime.strptime(x.meeting_time, '%H:%M').time()))\n",
    "print(*[f'{x.surname} {x.name}' for x in data], sep='\\n')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.16"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
