{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "a53576ff-e7a0-4ba2-b696-8e81886bcedc",
   "metadata": {},
   "source": [
    "## Task \"Статистика длин слов\"\n",
    "\n",
    "Дана последовательность слов. Напишите программу, которая группирует слова из этой последовательности по их длине и определяет количество слов в каждой полученной группе.\n",
    "\n",
    "**Формат входных данных**\n",
    "\n",
    "На вход программе подается последовательность слов, разделенных пробелом.\n",
    "\n",
    "**Формат выходных данных**\n",
    "\n",
    "Программа должна сгруппировать слова из введенной последовательности по их длине и определить количество слов в каждой полученной группе. Каждую группу характеризуют два числа — длина слов в этой группе и количество слов в этой группе. Например, для группы {is, to, hi, no} это числа 2 и 4. Программа должна вывести данные о каждой группе, расположив их в порядке увеличения количества слов в них, каждые на отдельной строке, в следующем формате:\n",
    "\n",
    "Слов длины <длина слов в группе>: <количество слов в группе>\n",
    "\n",
    "**Примечание 1.** Если две разные группы имеют равное количество слов, то первой должна следовать та группа, слово которой в исходной последовательности встречается раньше."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "52a20af6-c0ff-48f3-ba13-053abcfd2c4b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Слов длины 8: 1\n",
      "Слов длины 2: 1\n",
      "Слов длины 7: 2\n",
      "Слов длины 5: 2\n",
      "Слов длины 4: 3\n"
     ]
    }
   ],
   "source": [
    "from collections import Counter\n",
    "\n",
    "in_str = 'Любимой песни слог Знакомый ритм слов Панацея от всего'\n",
    "\n",
    "word_counter = Counter([len(x) for x in in_str.split()])\n",
    "\n",
    "print(*[f'Слов длины {w}: {k}' for w, k in sorted(word_counter.most_common(), key=lambda x: x[1])], sep='\\n')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.16"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
