{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "ad7264d6-7495-4331-8e9b-62dfcb8a9951",
   "metadata": {},
   "source": [
    "## Task \"Не поленимся и запишем\"\n",
    "\n",
    "Тимур составляет список покупок, но так как на его клавиатуре перестал работать блок с цифрами, то вместо указания количества товара числом, он добавляет его в список столько раз, сколько планирует купить. Все товары Тимур записывает в нижнем регистре через запятую.\n",
    "\n",
    "Напишите программу, которая выводит все товары из данного списка покупок, указывая для каждого его количество.\n",
    "\n",
    "**Формат входных данных**\n",
    "\n",
    "На вход программе подается последовательность товаров, разделенных запятой без пробелов.\n",
    "\n",
    "**Формат выходных данных**\n",
    "\n",
    "Программа должны вывести все введенные товары, указывая для каждого, сколько раз он встречается в данной последовательности. Товары должны быть расположены в лексикографическом порядке, каждый на отдельной строке, в следующем формате:\n",
    "\n",
    "<товар>: <количество>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "937894bf-e037-41de-8921-ea642bea0cfd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "банан: 2\n",
      "груша: 1\n",
      "киви: 4\n",
      "лимон: 3\n"
     ]
    }
   ],
   "source": [
    "from collections import Counter\n",
    "\n",
    "in_str = 'лимон,лимон,лимон,груша,банан,банан,киви,киви,киви,киви'\n",
    "\n",
    "print(*[f'{key}: {value}' for key, value in sorted(Counter([x for x in in_str.split(',')]).items())], sep='\\n')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.16"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
