{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "a03c6d12-f194-40ab-aeee-926e7151f4fd",
   "metadata": {},
   "source": [
    "## Task \"Бесплатные курсы берут свое 😭\"\n",
    "\n",
    "Тимур продает книги по математике за 1—11 класс. У него есть список, в котором указаны все книги, имеющиеся в наличии. К Тимуру приходят n покупателей, называют номер класса, за который они хотят приобрести книгу, и сумму, которую они готовы заплатить, и если книга есть в наличии, Тимур ее продает.\n",
    "\n",
    "Напишите программу, которая вычисляет общую сумму денег, которую Тимур заработает на продаже книг.\n",
    "\n",
    "**Формат входных данных**\n",
    "\n",
    "На вход программе в первой строке подается последовательность чисел, разделенных пробелом, представляющих набор книг, которые имеются в наличии. Каждое число последовательности — книга за указанный класс, например, последовательность 1 1 4 представляет набор из двух книг за первый класс и одной книги за четвертый класс. Вторая строка содержит число n — количество покупателей. В последующих n строках вводятся два числа, разделенные пробелом, где первое число является номером класса, второе — суммой, предлагаемой покупателем.\n",
    "\n",
    "**Формат выходных данных**\n",
    "\n",
    "Программа должна вывести единственное число — общую сумму денег, которую заработал Тимур.\n",
    "\n",
    "**Примечание.** Рассмотрим первый тест. В первой строке указан список книг, которые есть в наличии:\n",
    "\n",
    "2 книги за 1-й класс\n",
    "1 книга за 11-й класс\n",
    "3 книги за 9-й класс\n",
    "2 книги за 5-й класс\n",
    "1 книга за 7-й класс\n",
    "\n",
    "В следующей строке указано число \n",
    "\n",
    "7 — количество покупателей. Последующие 7 строк содержат номер класса и некоторую сумму:\n",
    "\n",
    "первый покупатель приобретает книгу за 1-й класс за 300р  \n",
    "второй покупатель приобретает книгу за 1-й класс за 250р  \n",
    "третий покупатель приобретает книгу за 11-й класс за 400р  \n",
    "книг за 1-й класс больше нет в наличии, поэтому покупка невозможна  \n",
    "пятый покупатель приобретает книгу за 7-й класс за 200р  \n",
    "шестой покупатель приобретает книгу за 9-й класс за 400р  \n",
    "книг за 7-й класс больше нет в наличии, поэтому покупка невозможна\n",
    "\n",
    "Итого Тимур заработал 300+250+400+200+400=1550р."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "00a9b31a-07ff-4d2e-be04-35ba078141b0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0\n"
     ]
    }
   ],
   "source": [
    "from collections import Counter\n",
    "\n",
    "book_store = Counter(map(int, '1 1 2 3 4 5'.split()))\n",
    "n = 3\n",
    "buy_str = '9 1000, 10 2000, 11 1500'\n",
    "income = 0\n",
    "buys = [tuple(map(int, x.split())) for x in buy_str.split(',')]\n",
    "\n",
    "for grade, price in buys:\n",
    "    if book_store.get(grade):\n",
    "        income += price\n",
    "        book_store -= Counter({grade: 1})\n",
    "        \n",
    "print(income)"
   ]
  }
 ],
 "metadata": {
  "interpreter": {
   "hash": "e2562e5f1dc67fe0fe567c9a0f4e9063dbf1a64329752bf508d5198f12744fe1"
  },
  "kernelspec": {
   "display_name": "Python 3.11.2 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
