{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "af06cefc-3204-44f1-b0ab-c762cf1969f3",
   "metadata": {},
   "source": [
    "## Task \"А сколько стоит курс?\"\n",
    "\n",
    "Тимур живет в мире, в котором цена товара определяется как сумма Unicode кодов букв его названия. Буквенным обозначением данной валюты являются две заглавные латинские буквы UC. Например, ручка в его мире стоит:\n",
    "\n",
    "1088+1091+1095+1082+1072=5428UC\n",
    "\n",
    "Тимур составляет список покупок, но так как на его клавиатуре перестал работать блок с цифрами, то вместо указания количества товара числом, он добавляет его в список столько раз, сколько планирует купить. Все товары Тимур записывает в нижнем регистре через запятую.\n",
    "\n",
    "Напишите программу, которая группирует одинаковые товары из данного списка покупок и определяет стоимость каждой группы.\n",
    "\n",
    "**Формат входных данных**\n",
    "\n",
    "На вход программе подается последовательность товаров, разделенных запятой без пробелов.\n",
    "\n",
    "**Формат выходных данных**\n",
    "\n",
    "Программа должна сгруппировать одинаковые товары, определить общую стоимость каждой группы и вывести полученный результат. Товары должны быть расположены в лексикографическом порядке, каждый на отдельной строке, в следующем формате:\n",
    "\n",
    "<товар>: <цена за единицу товара> UC x <количество товаров в группе> = <общая стоимость группы> UC\n",
    "\n",
    "**Примечание 1.** Программа должна добавлять нужное количество пробелов, если название товара имеет меньшую длину, чем другие.\n",
    "\n",
    "**Примечание 2.** Получить Unicode код символа можно с помощью функции ord()."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "5b57286b-fd72-4ac4-a837-45c59bf5319c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "брюки      : 5425 UC x 1 = 5425 UC\n",
      "носки      : 5422 UC x 1 = 5422 UC\n",
      "рубашка    : 7574 UC x 3 = 22722 UC\n",
      "сырный соус: 10896 UC x 1 = 10896 UC\n",
      "футболка   : 8669 UC x 3 = 26007 UC\n"
     ]
    }
   ],
   "source": [
    "from collections import Counter\n",
    "\n",
    "in_str = 'рубашка,футболка,футболка,брюки,футболка,сырный соус,рубашка,носки,рубашка'.split(',')\n",
    "\n",
    "goods_counter = Counter([(x, sum([ord(y) for y in x if y != ' '])) for x in in_str])\n",
    "max_good_len = max(map(len, in_str))\n",
    "\n",
    "print(*[f'{key[0]:{max_good_len}}: {key[1]} UC x {value} = {key[1] * value} UC' for key, value in sorted(goods_counter.items())], sep='\\n')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.16"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
