{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Task \"Булочный магнат\"\n",
    "\n",
    "После ухода сети Макдональдс из России Тимур решил открыть свою небольшую бургерную. Цена каждого бургера в его ресторане определяется количеством ингредиентов, которые выбирает сам посетитель. Вам доступны словари, в которых в качестве ключа указано название ингредиента, а в качестве значения — его цена. Все ингредиенты разбиты по категориям, например, овощи содержатся в одном словаре, соусы — в другом.\n",
    "\n",
    "Напишите программу, которая принимает на вход ингредиенты, выбранные посетителем, и определяет их общую стоимость.\n",
    "\n",
    "**Формат входных данных**\n",
    "\n",
    "На вход программе подается последовательность ингредиентов, разделенных запятой без пробелов.\n",
    "\n",
    "**Формат выходных данных**\n",
    "\n",
    "Программа должна определить общую стоимость введенных ингредиентов и вывести полученный результат в виде чека, в котором указаны ингредиенты в лексикографическом порядке, количество каждых и их общая стоимость, в следующем формате:\n",
    "\n",
    "<ингредиент 1> x <количество 1>  \n",
    "<ингредиент 2> x <количество 2>  \n",
    "...  \n",
    "-------------------------------  \n",
    "ИТОГ: <общая стоимость>р\n",
    "\n",
    "**Примечание 1.** Программа должна добавлять нужное количество пробелов, если один ингредиент имеет меньшую длину, чем другие.\n",
    "\n",
    "**Примечание 2.** Длина пунктирной линии должна равняться длине самой длинной строки в чеке, включая строку с итоговой стоимостью.\n",
    "\n",
    "**Примечание 3.** Гарантируется, что все ингредиенты, выбранные посетителем, присутствуют в словарях."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "сыр x 15\n",
      "----------\n",
      "ИТОГ: 375р\n"
     ]
    }
   ],
   "source": [
    "from collections import Counter, ChainMap\n",
    "\n",
    "\n",
    "bread = {'булочка с кунжутом': 15, 'обычная булочка': 10, 'ржаная булочка': 15}\n",
    "meat = {'куриный бифштекс': 50, 'говяжий бифштекс': 70, 'рыбный бифштекс': 40}\n",
    "sauce = {'сливочно-чесночный': 15, 'кетчуп': 10, 'горчица': 10, 'барбекю': 15, 'чили': 15}\n",
    "vegetables = {'лук': 10, 'салат': 15, 'помидор': 15, 'огурцы': 10}\n",
    "toppings = {'сыр': 25, 'яйцо': 15, 'бекон': 30}\n",
    "\n",
    "burger_dict = ChainMap(bread, meat, sauce, vegetables, toppings)\n",
    "\n",
    "order = sorted(Counter('сыр,сыр,сыр,сыр,сыр,сыр,сыр,сыр,сыр,сыр,сыр,сыр,сыр,сыр,сыр'.split(',')).items())\n",
    "burger_price = Counter({comp: (burger_dict[comp] * price) for comp, price in order}).total()\n",
    "\n",
    "max_comp_str = max(map(lambda x: len(x[0]), order))\n",
    "comp_cut = '-' * (max(map(lambda x: len(str(x[1])), order)) + max_comp_str + 3)\n",
    "sum_cut = '-' * (7 + len(str(burger_price)))\n",
    "\n",
    "print(*[f'{x[0]:{max_comp_str}} x {x[1]}' for x in order], sep='\\n')\n",
    "print(comp_cut if comp_cut > sum_cut else sum_cut)\n",
    "print(f'ИТОГ: {burger_price}р')"
   ]
  }
 ],
 "metadata": {
  "interpreter": {
   "hash": "e2562e5f1dc67fe0fe567c9a0f4e9063dbf1a64329752bf508d5198f12744fe1"
  },
  "kernelspec": {
   "display_name": "Python 3.11.2 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
