{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "53b206d8-6886-40b6-9cfb-8e03e0c71f9b",
   "metadata": {},
   "source": [
    "## Task \"Бесплатные курсы берут свое 😢\"\n",
    "\r\n",
    "Для дополнительного заработка Тимур решил заняться продажей овощей. У него имеются данные о продажах за год, разделенные на четыре файла по кварталам: quarter1.csv, quarter2.csv, quarter3.csv и quarter4.csv. В каждом файле в первом столбце указывается название продукта, а в последующих — количество проданного продукта в килограммах за определенный месяц:\r\n",
    "\r\n",
    "продукт,январь,февраль,м  арт\r\n",
    "Картофель,39,  61,3\r\n",
    "Дайкон,51,  96,8\n",
    "3\r\n",
    "...\r\n",
    "Также присутствует файл prices.json, содержащий словарь, в котором ключом является название продукта, а значением — цена за килограмм в руб лях:\r\n",
    "\r\n",
    "{\r\n",
    "   \"Карто  фель\": 53,\r\n",
    "   \"Д  айко  н\"\n",
    ": 55,\r\n",
    "...\r\n",
    "}\r\n",
    "Напишите программу, которая выводит единственное число — сумму, заработанную Тимуром за год на продаже овощей."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "bdc0677f-6358-408c-ae5a-11fa1bdee8a1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'Картофель': 103, 'Дайкон': 230, 'Капуста': 146, 'Лук-порей': 179, 'Латук': 57, 'Болгарский перец': 202, 'Брокколи': 161, 'Кабачок': 182, 'Баклажан': 134, 'Редис': 170, 'Пекинская капуста': 129, 'Салат': 116, 'Томат': 62, 'Чили': 187, 'Сельдерей': 124, 'Пастернак': 101, 'Огурец': 207, 'Патиссон': 110, 'Репа': 230, 'Спаржа': 76}\n",
      "{'Картофель': 131, 'Дайкон': 108, 'Капуста': 208, 'Лук-порей': 99, 'Латук': 224, 'Болгарский перец': 223, 'Брокколи': 188, 'Кабачок': 47, 'Баклажан': 150, 'Редис': 164, 'Пекинская капуста': 181, 'Салат': 91, 'Томат': 153, 'Чили': 176, 'Сельдерей': 139, 'Пастернак': 151, 'Огурец': 194, 'Патиссон': 225, 'Репа': 155, 'Спаржа': 131}\n",
      "{'Картофель': 115, 'Дайкон': 203, 'Капуста': 195, 'Лук-порей': 155, 'Латук': 122, 'Болгарский перец': 159, 'Брокколи': 185, 'Кабачок': 154, 'Баклажан': 95, 'Редис': 157, 'Пекинская капуста': 134, 'Салат': 107, 'Томат': 204, 'Чили': 169, 'Сельдерей': 290, 'Пастернак': 81, 'Огурец': 197, 'Патиссон': 125, 'Репа': 138, 'Спаржа': 133}\n",
      "{'Картофель': 139, 'Дайкон': 177, 'Капуста': 154, 'Лук-порей': 242, 'Латук': 156, 'Болгарский перец': 210, 'Брокколи': 192, 'Кабачок': 181, 'Баклажан': 188, 'Редис': 85, 'Пекинская капуста': 123, 'Салат': 197, 'Томат': 155, 'Чили': 217, 'Сельдерей': 170, 'Пастернак': 176, 'Огурец': 123, 'Патиссон': 115, 'Репа': 106, 'Спаржа': 115}\n",
      "{'Картофель': 53, 'Дайкон': 55, 'Капуста': 63, 'Лук-порей': 64, 'Латук': 85, 'Болгарский перец': 55, 'Брокколи': 95, 'Кабачок': 75, 'Баклажан': 61, 'Редис': 94, 'Пекинская капуста': 91, 'Салат': 70, 'Томат': 93, 'Чили': 81, 'Сельдерей': 98, 'Пастернак': 74, 'Огурец': 69, 'Патиссон': 78, 'Репа': 63, 'Спаржа': 80}\n"
     ]
    }
   ],
   "source": [
    "from collections import Counter\n",
    "import csv\n",
    "import json\n",
    "\n",
    "data = Counter()\n",
    "for i in range(1, 5):\n",
    "    with open(f'../data/quarter{i}.csv', 'r', encoding='utf-8') as file:\n",
    "        quoter_dict = {x[0]: sum(map(int, x[1:])) for x in list(csv.reader(file))[1:]}\n",
    "        print(quoter_dict)\n",
    "\n",
    "\n",
    "with open('../data/prices.json', 'r', encoding='utf-8') as json_file:\n",
    "    prices = json.load(json_file)\n",
    "    print(prices)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
