{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Task \"Песочные часы\"\n",
    "\n",
    "Напишите программу с использованием рекурсивной функции, которая выводит изображение песочных часов, составленное из цифр 1, 2, 3, и 4:\n",
    "\n",
    "1111111111111111    # 16 раз  \n",
    "  222222222222      # 12 раз  \n",
    "    33333333        # 8 раз  \n",
    "      4444          # 4 раза  \n",
    "    33333333        # 8 раз  \n",
    "  222222222222      # 12 раз  \n",
    "1111111111111111    # 16 раз  \n",
    "\n",
    "**Формат входных данных**\n",
    "\n",
    "На вход программе ничего не подается.\n",
    "\n",
    "**Формат выходных данных**\n",
    "\n",
    "Программа должна вывести изображение песочных часов, составленное из цифр 1, 2, 3, и 4, представленное в условии задачи.\n",
    "\n",
    "**Примечание.** Количество цифр в каждой строке, указанное в комментариях, выводить не нужно."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1111111111111111\n",
      "  222222222222\n",
      "    33333333\n",
      "      4444\n",
      "    33333333\n",
      "  222222222222\n",
      "1111111111111111\n"
     ]
    }
   ],
   "source": [
    "def sand_clock():\n",
    "    def rec(n):\n",
    "        \n",
    "        if n > 1:\n",
    "            print(' ' * 2 * (4 - n) + str(5 - n) * (4 * n))\n",
    "            rec(n - 1)\n",
    "        print(' ' * 2 * (4 - n) + str(5 - n) * (4 * n))\n",
    "    rec(4)\n",
    "\n",
    "sand_clock()\n",
    "    "
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "name": "python",
   "version": "3.10.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
